app/views/book/list.html.erb

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
<ul id="subjects">
	<% Subject.find(:all) do |c| %>