app/views/book/show_subjects.html.erb

SELECT "books".* FROM "books" WHERE "books"."subject_id" = $1  [["subject_id", 1]]
---
<ul>
	<% @subject.books.each do |c| %>