app/controllers/book_controller.rb

SELECT "books".* FROM "books"
---
	def list
		@books = Book.all

SELECT "subjects".* FROM "subjects"
---
	def new
		@book = Book.new
		@subjects = Subject.all

INSERT INTO "books" ("title", "price", "subject_id", "description", "created_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Advance Physics"], ["price", 390.0], ["subject_id", 1], ["description", "This is test to create new book"], ["created_at", 2017-03-05 10:54:23 UTC]]
---
	def create
		@book = Book.new(book_params)

		if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "subjects".* FROM "subjects"
---
	def edit
		@book = Book.find(params[:id])
		@subjects = Subject.all

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show_subjects
		@subject = Subject.find(params[:id])